/*

Есть интеерсная задумка, сущность worker - по сути это представляет собой работника, который может выполнять любую
произвольную задачу, которую положит ей в ее очередь. В чем интеерсность моего подхода.

Каждый воркек будет иметь слудущую конфигурация:

1) Указывается номер ядра процессара, на котором воркер будет работать(это ядро ему можно предоставить как в его личное пользование, так
и разделять его между другими процессами)

2) Указывается квоты на ресурсы, такие как потребялемая RAM память(c указанием NUMA узла), размера дискового пространства,
количества дескрипторов и тд.

3) Возможность запускать воркера как в другом потоке, так и в другом процессе(это для тех случаев, когда вам нужна гарантия, что
даже если ошибка в коде обработчика одного из вокреров приведет к падению, это не затронуо остальные воркеров, каждый из воркеров будет
работать в своем отдельном процессе и можно даже рестартовать упавшие воркеры).

Это дает своего рода + акторную модель работы.

4) Каждый воркер будет иметь свои кольцевую IPC lock-free очередь, положив тупа обьект-задачу, воркер сможет ее получить.

5) Внутри воркера вам доступны IPC lock-free очереди других воркеров и вы можете с ними общаться.

6) Каждый воркер по сути отрезан от остального "мира", никакие другие потоки не смогут иметь доступ в вашим данным(это достигается за счет
определнных аргументов clone системного вызова, едиснтвенная связть с внешним миром это его очередь и сокеты)
 - хотел уточнить про отрезаность от остального мира воркера. В классическом случае при старте нового потока, то у них общее только секция bss, rodata & data, в боевом режиме я бы предпочем всегда каждый воркер делать в отдельном процессе, но в дебаге это не удобно, поэтому я отсавил бы режим при котором воркеры стартуют как отдельные потоки, но в реальных продах они будут стартовать как отдельные процессы  и потому никаких data race

*/